---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.ICodeCheckingParameterServer
source: html/b5e66475-9e0c-41db-2c96-7f9ab82bba19.htm
---
# ICodeCheckingParameterServer Methods

Implement this method to return a description of the server.